000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ВозвратТоваровОтРозничногоПокупателя/ВозвратТоваровОтРозничногоПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВозвратТоваровОтРозничногоПокупателя</name>
  <attributes>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДисконтнойКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратТоваровОтПокупателя</name>
    <type>
      <types>DocumentObject.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЭквайринга</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходныйКассовыйОрдер</name>
    <type>
      <types>DocumentObject.РасходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокДокументовОплатаОтПокупателяПлатежнойКартой</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОФизЛица</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОФизЛицаИП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧекДатаВозврат</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНомерВозврат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереключательОплатаСложная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатЧекаККМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПродажи</name>
      <type>
        <types>DocumentRef.РеализацияТоваров</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧекККМ</name>
      <type>
        <types>DocumentRef.ЧекККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатЧекаККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентТорговойУступки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТорговойУступки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасхожденийДенежныхСредств</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Послеплата</name>
    <comment>Только для интернет-магазина.</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС14</name>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
  </enumValues>
  <enumValues>
    <name>НеНДС</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БанковскийКредит</name>
      <description>Банковский кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаКартойИнтернетЗаказа</name>
      <description>Оплата картой интернет заказа</description>
    </items>
    <items>
      <name>ОплатаПлатежнойКартой</name>
      <description>Оплата платежной картой</description>
    </items>
    <items>
      <name>ОплатаПодарочнымСертификатом</name>
      <description>Оплата подарочным сертификатом</description>
    </items>
    <items>
      <name>Послеплата</name>
      <description>Пiсляплата</description>
    </items>
    <items>
      <name>Предоплата</name>
      <description>Передплата</description>
    </items>
  </predefined>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты_ПРРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ВозвратТоваровОтРозничногоПокупателя/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Коллекция колонок табличного поля "Товары".
Перем мСклонение;

Перем МассивСформированныхДокументов;

// Выводит в окне информацию об ошибке
//
// Параметры
//  ТекстОшибки - строка
//
Процедура ВывестиИнформациюОбОшибке(ТекстОшибки) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ФормаИнформацииОбОшибке = ПолучитьОбщуюФорму("ФормаИнформацииОбОшибке");
	ФормаИнформацииОбОшибке.ТекстОшибки = ТекстОшибки;
	ФормаИнформацииОбОшибке.ОткрытьМодально();
	#КонецЕсли
	
КонецПроцедуры

// Процедура создает новый документ  ВозвратТоваровОтПокупателя
//
Процедура СформироватьВозвратТоваровОтПокупателя() Экспорт

	ВозвратТоваровОтПокупателя = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();

	ВозвратТоваровОтПокупателя.Склад                 = Склад;
	ВозвратТоваровОтПокупателя.Магазин               = Склад.Магазин;
	ВозвратТоваровОтПокупателя.Ответственный         = Пользователи.ТекущийПользователь();
	ВозвратТоваровОтПокупателя.АналитикаХозяйственнойОперации = АналитикаХозяйственнойОперации;
	ВозвратТоваровОтПокупателя.Организация           = Организация;
	
	ЗаполнитьЗначенияСвойств(ВозвратТоваровОтПокупателя, ЭтотОбъект);
	
	УчитыватьНДС = ОпределитьУчетНДС();
	ВозвратТоваровОтПокупателя.УчитыватьНДС    = УчитыватьНДС;
	ВозвратТоваровОтПокупателя.ЦенаВключаетНДС = УчитыватьНДС; //в обработке всегда сумма включает НДС
	
	ВозвратТоваровОтПокупателя.УстановитьНовыйНомер();
	ВозвратТоваровОтПокупателя.Товары.Загрузить(Товары.Выгрузить());
	ВозвратТоваровОтПокупателя.Серии.Загрузить(Серии.Выгрузить());
	
	ЕстьОшибки = Ложь;
	
	ПродажиСервер.ПроверитьВозможностьВозвратаОтПокупателя( ВозвратТоваровОтПокупателя, ЕстьОшибки, ЭтотОбъект);
	
	Если НЕ ЕстьОшибки Тогда
		ВозвратТоваровОтПокупателя.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		МассивСформированныхДокументов.Добавить(ВозвратТоваровОтПокупателя.Ссылка);
		ИсторияРаботыПользователя.Добавить(ВозвратТоваровОтПокупателя.Ссылка);
	Иначе
		ВозвратТоваровОтПокупателя.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает новый документ  РасходныйКассовыйОрдер
//
Процедура СформироватьРасходныйКассовыйОрдер() Экспорт

	РасходныйКассовыйОрдер = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();

	СуммаВозвратаНаличными = 0.00;
	Для Каждого СтрокаОплаты Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты) И СтрокаОплаты.ВидОплаты = Справочники.ВидыОплатЧекаККМ.Наличные Тогда
			СуммаВозвратаНаличными = СуммаВозвратаНаличными + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если СуммаВозвратаНаличными = 0.00 Тогда
		
		Если Не РасходныйКассовыйОрдер.ЭтоНовый() Тогда //уже записали
			РасходныйКассовыйОрдер.Удалить();
			РасходныйКассовыйОрдер = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
		КонецЕсли;
		
		//наличными ничего не возвращаем, значит РКО делать и не надо
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ЗаполнениеВозвратТоваровОтРозничногоПокупателя");
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("Дата", Дата);
	СтруктураПараметров.Вставить("Касса", Касса);
	СтруктураПараметров.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	СтруктураПараметров.Вставить("Контрагент", Контрагент);
	СтруктураПараметров.Вставить("Выдать", ФИОФизЛица);
	СтруктураПараметров.Вставить("Основание", Основание);
	СтруктураПараметров.Вставить("ПоДокументу", ПоДокументу);
	СтруктураПараметров.Вставить("Приложение", Приложение + ", Чек № " + ЧекНомер + " от " + Формат(ЧекДата, "ДЛФ=DD"));
	СтруктураПараметров.Вставить("СуммаДокумента", СуммаВозвратаНаличными);
	СтруктураПараметров.Вставить("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
	СтруктураПараметров.Вставить("ДокументРасчетовСКонтрагентом", ВозвратТоваровОтПокупателя.Ссылка);
	РасходныйКассовыйОрдер.Заполнить(СтруктураПараметров);
	
	РасходныйКассовыйОрдер.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	МассивСформированныхДокументов.Добавить(РасходныйКассовыйОрдер.Ссылка);
	ИсторияРаботыПользователя.Добавить(РасходныйКассовыйОрдер.Ссылка);
КонецПроцедуры

// Сообщение пользователю
//
Процедура СообщитьПользователюСУчетомРежима(ТекстОшибки) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ВывестиИнформациюОбОшибке(ТекстОшибки);
	#Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки);
	#КонецЕсли
	

КонецПроцедуры

// Формирует документы возврата
//
// Возвращаемое значение:
//  Булево - Результат, формирования документов
//
Функция СформироватьДокументы() Экспорт
	
	Результат = Истина;
	МассивСформированныхДокументов = Новый Массив;
	
	ПредупредитьОБК = Ложь;
	Для Каждого СтрокаОплаты Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты)
		 И СтрокаОплаты.ВидОплаты.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			ПредупредитьОБК = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПредупредитьОБК Тогда
		ТекстОшибки = НСтр("ru='Документы возврата денежных средств по банковскому кредиту сформированы не были." + Символы.ПС + "Автоматическое оформление возврата денежных средств по кредиту не реализованно в системе.'");
			
		СообщитьПользователюСУчетомРежима(ТекстОшибки)
	КонецЕсли;
	
	УдалитьДокументы();
	
	Попытка
		СформироватьВозвратТоваровОтПокупателя();
	Исключение
		
		ТекстОшибки = НСтр("ru='Документы не сформированы!" + Символы.ПС +
		 "Не удалось сформировать документ ""Возврат товаров от покупателя""'");
		
		СообщитьПользователюСУчетомРежима(ТекстОшибки);
		Результат = Ложь;
		
	КонецПопытки;
	
	Попытка
		
		СформироватьОплатуОтПокупателяПлатежнойКартой();
		
	Исключение
		
		ТекстОшибки = НСтр("ru='Документы не сформированы!" + Символы.ПС +
		 "Не удалось сформировать документ ""Операция по платежной карте""'");
			
		СообщитьПользователюСУчетомРежима(ТекстОшибки);
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Попытка
		
		СформироватьРасходныйКассовыйОрдер();
		
	Исключение
		
		ТекстОшибки = НСтр("ru='Документы не сформированы!" + Символы.ПС +
		 "Не удалось сформировать документ ""Расходный кассовый ордер"".'");
			
		СообщитьПользователюСУчетомРежима(ТекстОшибки);
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Если Не Результат Тогда
		УдалитьДокументы();
	Иначе
		ТекстОшибки = НСтр("ru='Документы успешно созданы!'");
			
		СообщитьПользователюСУчетомРежима(ТекстОшибки);
	КонецЕсли;
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("Результат", Результат);
	РезультатСтруктура.Вставить("МассивСформированныхДокументов", МассивСформированныхДокументов);
	Возврат РезультатСтруктура;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РазрешитьОформлениеВозвратовОтПокупателяБезДокументовПродажи = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьОформлениеВозвратовОтПокупателяБезДокументовПродажи, Ложь);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если РазрешитьОформлениеВозвратовОтПокупателяБезДокументовПродажи Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ДокументПродажи");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Склад");
	
	Если ПереключательОплатаСложная ТОгда
		МассивНепроверяемыхРеквизитов.Добавить("СуммаОплаты");
		МассивНепроверяемыхРеквизитов.Добавить("ВидОплаты");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Оплата");
		МассивНепроверяемыхРеквизитов.Добавить("Оплата.ВидОплаты");
		МассивНепроверяемыхРеквизитов.Добавить("Оплата.Сумма");
	КонецЕсли;
	
	
	ОбработкаТабличнойЧастиТоварыСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбработкаТабличнойЧастиТоварыСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,Документы.ВозвратТоваровОтПокупателя.ПараметрыУказанияСерий(ЭтотОбъект),Отказ);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		СтрокаЗаголовкаОшибки = НСтр("ru = 'Ошибки заполнения'");
		ТекстОшибки = "";
		
		МассивРеквизитовТоваров = Новый Массив;
		МассивРеквизитовОплат   = Новый Массив;
		МассивРеквизитовСерии   = Новый Массив;
		Для каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
			Если СтрНайти(ПроверяемыйРеквизит, "Товары.") > 0 Тогда
				МассивРеквизитовТоваров.Добавить(СтрЗаменить(ПроверяемыйРеквизит, "Товары.", ""));
			ИначеЕсли СтрНайти(ПроверяемыйРеквизит, "Оплата.") > 0 Тогда
				МассивРеквизитовОплат.Добавить(СтрЗаменить(ПроверяемыйРеквизит, "Оплата.", ""));
			ИначеЕсли СтрНайти(ПроверяемыйРеквизит, "Серии.") > 0 Тогда
				МассивРеквизитовСерии.Добавить(СтрЗаменить(ПроверяемыйРеквизит, "Серии.", ""));
			ИначеЕсли ПроверяемыйРеквизит = "Товары" Тогда
				Если Товары.Количество() = 0  Тогда
					ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Не введено ни одной строки в список Товары.'");
					Отказ = Истина;
				КонецЕсли;
			ИначеЕсли ПроверяемыйРеквизит = "Оплата" Тогда
				Если Оплата.Количество() = 0  Тогда
					ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Не введено ни одной строки в список Оплата.'");
					Отказ = Истина;
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект[ПроверяемыйРеквизит]) Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Поле %1 не заполнено'"),
				ПроверяемыйРеквизит);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивРеквизитовТоваров.Количество() > 0 Тогда
			Для каждого СтрокаТаблицы Из Товары Цикл
				Для каждого ЭлементМассиваПроверки Из МассивРеквизитовТоваров Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ЭлементМассиваПроверки]) Тогда
						ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не заполнена колонка %1 в строке %2 списка Товары'"),
						ЭлементМассиваПроверки,
						СтрокаТаблицы.НомерСтроки);
						Отказ = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если МассивРеквизитовОплат.Количество() > 0 Тогда
			Для каждого СтрокаТаблицы Из Оплата Цикл
				Для каждого ЭлементМассиваПроверки Из МассивРеквизитовОплат Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ЭлементМассиваПроверки]) Тогда
						ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не заполнена колонка %1 в строке %2 списка Оплата'"),
						ЭлементМассиваПроверки,
						СтрокаТаблицы.НомерСтроки);
						Отказ = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если МассивРеквизитовСерии.Количество() > 0 Тогда
			Для каждого СтрокаТаблицы Из Серии Цикл
				Для каждого ЭлементМассиваПроверки Из МассивРеквизитовСерии Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ЭлементМассиваПроверки]) Тогда
						Если ЗначениеЗаполнено(СтрокаТаблицы.Характеристика)  Тогда
							ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не заполнена колонка %1 для номенклатуры %2' (%3)"),
							ЭлементМассиваПроверки,
							СтрокаТаблицы.Номенклатура,
							СтрокаТаблицы.Характеристика);
						Иначе
							ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не заполнена колонка %1 для номенклатуры %2'"),
							ЭлементМассиваПроверки,
							СтрокаТаблицы.Номенклатура);
						КонецЕсли;
						Отказ = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		
		Если Отказ Тогда
			ТекстОшибки = СтрокаЗаголовкаОшибки + Символы.ПС + ТекстОшибки;
			ВывестиИнформациюОбОшибке(ТекстОшибки);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Печать

Функция ПодключитьКомпонентуСклонение()
	
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Компонента = "NameDecl.dll";
		Попытка
			ЗагрузитьВнешнююКомпоненту(Компонента);
			Результат = Новый("AddIn.NameDeclension");
		Исключение
			Результат = Неопределено;
		КонецПопытки;
	#Иначе
		Результат = Неопределено;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Прочее

Процедура СформироватьОплатуОтПокупателяПлатежнойКартой()
	
	СуммаВозвратаПлатежнойКартой = 0.00;
	Для Каждого СтрокаОплаты Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты)
		 И СтрокаОплаты.ВидОплаты.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
			СуммаВозвратаПлатежнойКартой = СуммаВозвратаПлатежнойКартой + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если СуммаВозвратаПлатежнойКартой = 0.00 Тогда
		//платежными картами ничего не возвращаем, значит возврат покупателю платежной картой делать и не надо
		Возврат;
	КонецЕсли;
	
	//получим таблицу оплат, свернутую по виду оплат
	СвернутыеОплаты = Оплата.Выгрузить();
	
	Для Каждого СтрокаОплаты Из СвернутыеОплаты Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОплаты.ВидОплаты)
		 ИЛИ СтрокаОплаты.ВидОплаты.ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
			Продолжить;
		КонецЕсли;
		
		ОплатаОтПокупателяПлатежнойКартой = Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ЗаполнениеВозвратТоваровОтРозничногоПокупателя");
		СтруктураПараметров.Вставить("Организация", Организация);
		СтруктураПараметров.Вставить("Дата", Дата);
		СтруктураПараметров.Вставить("Магазин", Магазин);
		СтруктураПараметров.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
		СтруктураПараметров.Вставить("ДоговорЭквайринга", СтрокаОплаты.ЭквайринговыйТерминал.Владелец);
		СтруктураПараметров.Вставить("ЭквайринговыйТерминал", СтрокаОплаты.ЭквайринговыйТерминал);
		СтруктураПараметров.Вставить("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
		СтруктураПараметров.Вставить("ДокументРасчетовСКонтрагентом", ВозвратТоваровОтПокупателя.Ссылка);
		СтруктураПараметров.Вставить("Эквайрер", ?(ЗначениеЗаполнено(СтрокаОплаты.ЭквайринговыйТерминал), СтрокаОплаты.ЭквайринговыйТерминал.Владелец.Эквайрер, Справочники.Контрагенты.ПустаяСсылка()));
		СтруктураПараметров.Вставить("ВидОплаты", СтрокаОплаты.ВидОплаты);
		СтруктураПараметров.Вставить("Контрагент", Контрагент);
		СтруктураПараметров.Вставить("СуммаДокумента", СтрокаОплаты.Сумма);
		СтруктураПараметров.Вставить("ПроцентТорговойУступки", СтрокаОплаты.ПроцентТорговойУступки);
		СтруктураПараметров.Вставить("СуммаТорговойУступки", СтрокаОплаты.СуммаТорговойУступки);
		
		ОплатаОтПокупателяПлатежнойКартой.Заполнить(СтруктураПараметров);
		ОплатаОтПокупателяПлатежнойКартой.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		
		//поместим ссылку на документ в список, чтобы в случае переформирования документов удалить старые
		СписокДокументовОплатаОтПокупателяПлатежнойКартой.Добавить(ОплатаОтПокупателяПлатежнойКартой.Ссылка);
		
		МассивСформированныхДокументов.Добавить(ОплатаОтПокупателяПлатежнойКартой.Ссылка);
		ИсторияРаботыПользователя.Добавить(ОплатаОтПокупателяПлатежнойКартой.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

// Удаляет документы из базы
//
Процедура УдалитьДокументы()
	
	// Очищает список перед созданием
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СсылкаНаДокумент Из СписокДокументовОплатаОтПокупателяПлатежнойКартой Цикл
		
		ДокументОбъект = СсылкаНаДокумент.Значение.ПолучитьОбъект();
		
		Если ДокументОбъект.Проведен Тогда 
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.Записать();
		ДокументОбъект.Удалить();
		
	КонецЦикла;
	
	СписокДокументовОплатаОтПокупателяПлатежнойКартой.Очистить();
	
	Если ЗначениеЗаполнено(ВозвратТоваровОтПокупателя.Ссылка) Тогда
		
		ДокументОбъект = ВозвратТоваровОтПокупателя.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект.Проведен Тогда 
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.Записать();
		ДокументОбъект.Удалить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РасходныйКассовыйОрдер.Ссылка) Тогда
		
		ДокументОбъект = РасходныйКассовыйОрдер.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект.Проведен Тогда 
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.Записать();
		ДокументОбъект.Удалить();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьУчетНДС()
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если СтрокаТоваров.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мСклонение = ПодключитьКомпонентуСклонение();
